tap "epk/epk"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "tursodatabase/tap"
brew "bash"
brew "bash-completion", link: false
brew "bash-completion@2"
brew "gh"
brew "gnu-tar"
brew "gnupg"
brew "neovim"
brew "node"
brew "nvm"
brew "starship"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tursodatabase/tap/turso"
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
cask "epk/epk/font-sf-mono-nerd-font"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "zixuanchen.vitest-explorer"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "avm"
npm "@google/gemini-cli"
npm "corepack"
